#!/usr/bin/env python
# -*- coding: utf-8 -*-

def input_texts():
    texts =[]

    t="「評論家が選ぶベスト・テンは必ずしも興行成績と一致しません。評論家は、観客が発見できなかった、つまり興行的には振るわなかった映画も見ていますので、何人かがそんな作品を持ち点の高い上位で推してくれば、一般の方にとって耳慣れない作品がランクインしてくることもあるわけです。ランクインする作品には2種類のタイプがあります。ひとつは、1位（10点）で推してくる方が数人いるケース、下位（1点、2点）ではあっても比較的多くの方が支持するケース。『君の名は。』は後者なのではないでしょうか？　ですので、評価した方は多いものの、得点にはたぶん結びつかなかった。ただ、2月3日発売の『キネマ旬報』で発表される読者のベスト・テンは、皆さんがご覧になっている興行収入が高い作品が上位に選ばれることが多いため、ランク・インの可能性は高いでしょう」"
    texts.append(t)


    t="カロリー制限はやはり長寿に効果がある、とする研究結果を米国の二つの研究チームがまとめ、１７日付の英科学誌ネイチャー・コミュニケーションズに発表した。両チームは１９８０年代後半からアカゲザルで実験を続け、効果をめぐって相反する結果を発表。両チームが共同で実験データを再解析し、「効果あり」で結論が一致したという。"
    texts.append(t)

    #知恵袋
    #http://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q1384938883
    t="振られたのは僕だけど、僕のせいなのか。彼女の激変ぶりに責任を感じます。彼女の外見に惚れたのではなく中身に惚れたのに、余りの激変ぶりに気持ちがついていけませんでした。その夜、別れて始めて連絡を取り食事の誘いをしましたが、素っ気なく断られてしまいました。激変ぶりに驚いた様子が顔に出てしまい、彼女に感づかれていると思います。そして、やり直したいと伝えようと思っていたのに、色々状況の整理がつかなくて気持ちすら伝えることが出来ませんでした。"
    texts.append(t)

    #http://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q12169361252
    t="ワンピースのレイジュ、イチジ、ニジ、サンジ、ヨンジって5つ子なんですか？見た目はイチジが一番歳上で、ヨンジが末っ子っぽい(レイジュはイチジとニジの間くらい？)ですが、今週のジャンプ読んだら男4人は一緒に生まれて、レイジュは先に生まれてたように見えました。実際はどうなんでしょうか？まだ作中語られたか分かりませんが…。"
    texts.append(t)


    t="昨日、近所の吉野家いったんです。吉野家。そしたらなんか人がめちゃくちゃいっぱいで座れないんです。で、よく見たらなんか垂れ幕下がってて、１５０円引き、とか書いてあるんです。もうね、アホかと。馬鹿かと。お前らな、１５０円引き如きで普段来てない吉野家に来てんじゃねーよ、ボケが。１５０円だよ、１５０円。なんか親子連れとかもいるし。一家４人で吉野家か。おめでてーな。よーしパパ特盛頼んじゃうぞー、とか言ってるの。もう見てらんない。お前らな、１５０円やるからその席空けろと。吉野家ってのはな、もっと殺伐としてるべきなんだよ。" 
    texts.append(t)


    t="新入社員の頃、課内で「伝説の鈴木さん」という名前がよく出ていた。ある日、主任から「この書類、伝説の鈴木さんに渡してきて」と頼まれた。「どこにいらっしゃるのですか？」と聞き返したら、「伝説の鈴木さんなんだから伝説の部屋に決まってんだろ。3階の奥だよ」と言われた。伝説の部屋という言葉にわくわくしながら3階の奥へ行くと「電気設備課」があった。"
    texts.append(t)


    t="友人達と四人で汽車に乗った時のこと。その時の車両の座席は、通常全席が汽車の進行方向を向いているものを回転させる事で四人が向かい合っても座れるような仕組みのものだった。どうせなら皆一緒に座ろうと友人が座席を回転させると、座席と一緒に新聞を持ったおっさんが回転しながら現れた。友人はそのままその椅子を回転させ、おっさんは再び回転しながら元の位置に戻っていった。"
    texts.append(t)

    t="メロンパンは実在する。メロンパンにメロンは使われていない。メロンは実在する。ウグイスパンは実在する。ウグイスパンにうぐいすは使われていない。うぐいすは実在する。以上の事実をふまえれば、カッパ巻きが存在し。それにカッパが使われていない事からカッパは存在することは明らか"
    texts.append(t)


    
    t="初めてのデートで彼女と水族館に行った時に「これってガラス壊れたりしないのかなぁ」って彼女が言ってきたから「は？いやガラスだったらとっくに壊れてるから、これポリメタクリル酸エステル樹脂だから、壊れるわけないじゃん、ぶふぉ」って言ったら僕たちの関係が壊れました"
    texts.append(t)


    t="今日電車乗ってたら、女子中学生が 「なまユッケで人が死んだやきにくてんってさー。死んだ牛の肉出してたらしいよー。ヤバくね？」「マジそれありえなーい！」 とか会話してた"
    texts.append(t)
    
    t="親に赤点取ったのバレて「こんな点数取ったら将来何の仕事にも就けないでしょ！」って怒られたから、 「海賊王に俺はなるっ！」 って返したら 「あんたなんかグランドラインどころかレッドラインすら超えてないじゃない。」 ってうまいこと論破されたでござる"
    texts.append(t)
    


    t="昔、どこかのコンビニの前で、見た目ヤクザのような人が舎弟のヤンキーみたいな人に怒ってて、その内容が「にっしんさんが！にっしんさんがココまでお湯を入れて下さいって導いてくれとんのに完全に上回っとるやないかい！！」って舎弟がカップ麺のお湯を入れ過ぎた事に怒号してた光景が未だに忘れられない"
    texts.append(t)

    
    t="困っています。今体育の授業で 、ダンスをやっていて、明日発表会です。明日発表会なのに、今日の体育の授業でオタ芸をいきなり考え出して、トーチ8を何回やっても、動画を何回見てもできませんでした。そして、それは曲のサビの部分で踊るらしく、みんな違う動きをするので、カバーできません。どうすればよいでしょうか？"
    texts.append(t)

    
    t="蕎麦屋でおおはじかきました。ざる蕎麦とセットになってたお湯？の使い方が分からず、蕎麦を柔らかくするものだと思い蕎麦に全部かける。店員大爆笑。奮発して行ったのに酷い"
    texts.append(t)

    
    t="バイキング(食べ放題)で一人で来てたお客のおばさんに怒られました。私は過食症の為、少しでも節約しようとバイキングに行きました。そしてデザートでお皿にワッフルと生クリームを盛っていると『見てて気分悪い。常識的におかしくない？』と怒られました…過食症の私は普通の量が分からないので。。これって私が悪いんですかね？？"
    texts.append(t)

    
    
    t="一昨日の昼に友達二人とこういうファミレスに行ったとき、混んでたから名前書いてもらって待ってたら、しばらくして、三名様でお待ちのフ、フリーザさまーって呼ばれて、小声で、こういうの書く奴必ずいるよなって言ったら、友達がいきなり、さぁ、行きますよ。ザーボンさん、ドドリアさんって立ち上がった。"
    texts.append(t)
    

    t="今日、ブックオフで100円の文庫本買おうとしたら、俺、100円持ってなかった。店員が驚いてた。俺も驚いてた。後ろに並んでた人も驚いてた。"
    texts.append(t)


    t="睡眠薬飲み過ぎると中毒になるってホントですか？デマ。俺もう22年間毎日飲んでるけどちっとも中毒になんかなってない"
    texts.append(t)
    


    t="ファービーが「ナデナデシテー」ってうるさいから 頭の上にマッサージ器あてて死ぬほどナデナデしたら 「ファー…ブルスコ…ファー…ブルスコ…ファ-」ってなった。最初は面白かったんだけど、なんかキモくなったので首元を横から思い切りチョップしたら 「モルスァ」みたいなこと言いながらすごい勢いで飛んで行った。"
    texts.append(t)


    t="男の子「ねーねーお父さん。赤ちゃんはどこからくるの？」 父「赤ちゃんはね。コウノトリさんが運んでくるんだよ」 男の子「流通経路の話じゃなくて生産元の話だよ。あなたは魚の居場所を聞かれて船と答えるのか」 父「ちょっと待って」"
    texts.append(t)


    t="俺派遣でライン組み立てやってたけど  今月急に解雇告げられた 住む家もなくてヤングハローワークってとこに行って来て  そこで適職診断ってのをやったんだけど  好奇心旺盛なあなたは宇宙飛行士に向いています って結果が出て、もうどうしていいかわからん"
    texts.append(t)


    t="人気グループときおの山口達也が、22日に放送される日本テレビ系人気番組『ザ！鉄腕！だっしゅ！！2時間SP』で、東京都で絶滅危惧種（稀少生物）を発見したことがわかった。今回、城島茂とともに多摩川上流で、アユの生態調査へ向かった山口が見つけたのは、2015年9月以来2度目となるヤツメウナギ目ヤツメウナギ科の淡水魚「スナヤつめ」。しかも前回と違ってさらに珍しい姿となる、パッチリ目が開いている状態での発見となった。"
    texts.append(t)    


    t="分かんない！私には分かんないの！ブラッティって何がカッコいいの？ 血なんてイヤだよ痛いだけだよ！黒のどこがカッコいいの？ クレイジーのどこがいいのか分かんない！ 罪深いってなんなの？罪があるのの何がいいの！？ 犯罪者がカッコいいの？そもそも混沌てなに？ カオス？だからなんなの！闇ってなに！？暗ければいいの？ 正義と悪だとなんで悪がいいの？ 何で悪いほうがいいの？悪いから悪なんじゃないの！？ 右腕がうずくと何でカッコいいの？ 自分の力を制御できない感じがたまらないってｗ何それただの間抜けな人じゃん！"
    texts.append(t)    


    t="ヤバイ。宇宙ヤバイ。まじでヤバイよ、マジヤバイ。宇宙ヤバイ。まず広い。もう広いなんてもんじゃない。超広い。広いとかっても東京ドーム20個ぶんくらい？とか、もう、そういうレベルじゃない。何しろ無限。スゲェ！なんか単位とか無いの。何坪とか何へくたーるとかを超越してる。無限だし超広い。しかも膨張してるらしい。ヤバイよ、膨張だよ。"
    texts.append(t)    


    t="雨ってゅうのは。。。9割以上が水分。。。そしてきゅうりも、9割以上が水分。。。そぅ。。これゎもぅ。。。雨いこーるきゅうりってゅうコト。。。 空から降るいちおくのきゅうり。。。もぅまじ無理。。。浅漬けにしょ。。。"
    texts.append(t)
    

    t="俺、子供んときに近所の子にプロポーズしたことあるんだけど そのネタで小学校で「あいつが私に ぷぷぷ」って６年馬鹿にされ、 中学校で３年馬鹿にされ、高校でも３年馬鹿にされ いまだにゆうしょくのときに馬鹿にされる"
    texts.append(t)


    t="今、外で誰もいないと思って「ふぁー」って声出して、背伸びしたら屁が「ブッ」って出てしまったんだが ちょうどそこにどっかのオッサンがチャリで通ってたみたいで しかも屁を聞かれてしまったらしく、オッサンが「プッグッヘヘヘヘ」って笑いながら、川にチャリごとダイブしていった"
    texts.append(t)
    

    t="ツタヤのホラーコーナーに、題名とか何も書いてない、黒いパッケージのビデオが置いてあったんだけど、誰か観た人いる？ このビデオの存在知ってる？ すごく内容が気になります。それは仕切り用のダミーです。"
    texts.append(t)

    t="15日に実施された大学入試センター試験で、道内の受験生6人が試験場で電卓を使う不正行為をした問題で、当日の状況が17日、関係者への取材で分かった。6人は全員、試験で電卓が使えると勘違いしていた。試験監督が不正に気付いたのは試験開始から十数分後で、6人が机上に電卓を取り出す行為には気付かなかったという。"
    texts.append(t)

    
    t="気になる経済問題はなんですか。と聞かれてブラック企業問題を挙げるのは間違っていますか？また最近問題になった経済問題は何がありますか？新聞やネットで調べましたが難しく他の意見も聞きたくて質問させていただきました。よろしくお願いします。"
    texts.append(t)

    t="恋愛相談です。私は、小学生の時同じ学校だった男の子が少し気になっていました。通っていた塾が同じで、いっしょに遊んだり、電車でいっしょに塾に行ったりもしました。今、中2でその子は、受験をして、違う県にいます。相手は、私の事を何とも思っていないだろうけど、私はやっぱり好きだと思います。長期休みに地元に帰って来るので、会って話してみたいです。どう思いますか？"
    texts.append(t)


    t="会話とはちと違うが、今日ココイチで飯食ってたら近くの席にいた家族の４、５歳ぐらいの子供がずいぶん懐かしい歌を歌っていたので思わず聞き入ってしまった。「毎日毎日、僕らは鉄板の、上で焼かれて、嫌になっちゃうよ。ある朝僕は、店のおじさんと、喧嘩して、海に投げ込んだのさ」 むせた。"
    texts.append(t)


    t="「コレ良かったら食べて下さい。いらなかったら捨てちゃっていいですから」と、言うつもりだったのに「コレ捨てようと思ったんですけど、良かったら食べて下さい」と言ってしまった"
    texts.append(t)

    t="かつてハットリ君にはまり背中に刀を差して歩くのがデフォルトだった俺。はじめた倒した敵は母に連れられて行ったスーパーにいた外人だったらしい。 オーにんじゃぼーいと言われ激高し叩き切ったらやられたーと倒れてくれたそうだ。いい外人だった。もう一度会いたい。"
    texts.append(t)


    t="友達が「歴史とか勉強する意味ねぇよ。過去じゃん」と言ってきた。僕は迷わず彼の右頬をぶん殴った。友達は半泣きになりながら「何すんだよ」と叫んだ。僕はもう一度拳を振り上げる。咄嗟に防御の姿勢をとる友達。拳を下ろしながら、僕は言った。「そうやって防御できるのも過去を学んだおかげだろうが」ハッと何かに気付いたように、友達は涙を流し謝ってきた。僕はテキトーな事を言ったのに何コイツ泣いてるんだと思った"
    texts.append(t)



    t="駅のホームで電車待ってたとき階段から二人の外人が楽しそうにしゃべりながら降りてきた。 ガタイよくてイケメンマッチョな二人だった。よく見ると腕に刺青がしてあった。「粗大ゴミ」と"
    texts.append(t)

    t="中２のとき、英語の授業で先生がえすに「昼飯は英語で何というか」と聞いてきた。先生は多分「ランチ」と答えさせたかったのだろうが、えすには分からないようだった。先生は「お前がいつも食ってるヤツや。それを英語っぽく言うてみい」とヒントを出してくれた。じゅう数秒後、えすの口から「ヴェントゥー」という、誰も予想しなかった核爆弾級の言葉が発射された。"
    texts.append(t)


    return texts
